# St7SetSRALoadCaseName

Sets the name of the specified Spectral Response analysis Load Excitation case.

long St7SetSRALoadCaseName(long uID, long SRACase, char* CaseName)

Input Parameters

uID

Strand7 model file ID.

SRACase

Spectral Response load excitation case number.

CaseName

String containing the new name of the load excitation case.